Autodesk.Revit.DB.IFC.ExporterIFC.RemoveBuildingStorey(Autodesk.Revit.DB.ElementId)
Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.
id:
The level id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.AddBuildingStorey(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.IFC.IFCLevelInfo)
Adds building storey to the exporter's internal cache.
id:
The level id.
levelInfo:
The IFCLevelInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.GetLevelInfos
Returns a collection containing the information about all levels in the document.
Remarks:
Level information is currently automatically collected and cached in the ExporterIFC
object.  This method returns the cached information which is often needed during export
of particular building elements which reference levels, as well as to implement automatic
wall and column splitting.
Returns:
The collection of level information.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.GetLevelInfo(Autodesk.Revit.DB.ElementId)
Returns an object representing the information about a level in the document.
Remarks:
Level information is currently automatically collected and cached in the ExporterIFC
object.  This method returns the cached information for a given level,
which is often needed during export of particular building elements which reference levels, as well
as to implement automatic wall and column splitting.
levelId:
The level id.
Returns:
The level information.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012